In [30]:
import matplotlib.pyplot as plt
import pandas as pd
import pylab as pl 
import numpy as np
%matplotlib inline

In [32]:
df = pd.read_csv("housePrice.csv")
df.head()

,Area,Room,Parking,Warehouse,Elevator,Address,Price,Price(USD)
0,63,1,True,True,True,Shahran,1.850000e+09,61666.67
1,60,1,True,True,True,Shahran,1.850000e+09,61666.67
2,79,2,True,True,True,Pardis,5.500000e+08,18333.33
3,95,2,True,True,True,Shahrake Qods,9.025000e+08,30083.33
4,123,2,True,True,True,Shahrake Gharb,7.000000e+09,233333.33

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3479 entries, 0 to 3478
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Area        3479 non-null   object
 1   Room        3479 non-null   int64
 2   Parking     3479 non-null   bool
 3   Warehouse   3479 non-null   bool
 4   Elevator    3479 non-null   bool
 5   Address     3456 non-null   object
 6   Price       3479 non-null   float64
 7   Price(USD)  3479 non-null   float64
dtypes: bool(3), float64(2), int64(1), object(2)
memory usage: 146.2+ KB

In [36]:
print(df.isnull().sum())

Area           0
Room           0
Parking        0
Warehouse      0
Elevator       0
Address       23
Price          0
Price(USD)     0
dtype: int64

In [38]:
df.describe()

              Room         Price    Price(USD)
count  3479.000000  3.479000e+03  3.479000e+03
mean      2.079908  5.359023e+09  1.786341e+05
std       0.758275  8.099935e+09  2.699978e+05
min       0.000000  3.600000e+06  1.200000e+02
25%       2.000000  1.418250e+09  4.727500e+04
50%       2.000000  2.900000e+09  9.666667e+04
75%       2.000000  6.000000e+09  2.000000e+05
max       5.000000  9.240000e+10  3.080000e+06

In [56]:
dc = df.dropna(subset=['Address'])

In [72]:
df = df[df['Area'] <= 1000]
print(df)

       Area  Room  Parking  Warehouse  Elevator             Address  \
0      63.0     1     True       True      True             Shahran
1      60.0     1     True       True      True             Shahran
2      79.0     2     True       True      True              Pardis
3      95.0     2     True       True      True       Shahrake Qods
4     123.0     2     True       True      True      Shahrake Gharb
...     ...   ...      ...        ...       ...                 ...
3474   86.0     2     True       True      True  Southern Janatabad
3475   83.0     2     True       True      True            Niavaran
3476   75.0     2    False      False     False              Parand
3477  105.0     2     True       True      True              Dorous
3478   82.0     2    False       True      True              Parand

             Price  Price(USD)
0     1.850000e+09    61666.67
1     1.850000e+09    61666.67
2     5.500000e+08    18333.33
3     9.025000e+08    30083.33
4     7.000000e+09   233333.33
...            ...         ...
3474  3.500000e+09   116666.67
3475  6.800000e+09   226666.67
3476  3.650000e+08    12166.67
3477  5.600000e+09   186666.67
3478  3.600000e+08    12000.00

[3473 rows x 8 columns]